{
    "displayName": "Windows Security Baseline (for use with ACSC Windows Hardening Guidelines)",
    "description": "",
    "roleScopeTagIds": [
        "0"
    ],
    "TemplateDisplayName": "MDM Security Baseline for Windows 10 and later for November 2021",
    "TemplateId": "034ccd46-190c-4afc-adf1-ad7cc11262eb",
    "versionInfo": "November 2021",
    "settingsDelta": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "08a2f484-de31-445d-84a0-e3ed47e2be78",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_lockScreenActivateAppsWithVoice",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "bd718e99-5f72-4dcb-9489-a495054bd588",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_lockScreenBlockToastNotifications",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "811f2ce9-ba7f-4b7e-9758-8279ab9c9960",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditCredentialValidation",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c0e615ad-67be-4e16-9e36-61edcf35275b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditKerberosAuthenticationService",
            "valueJson": "\"none\"",
            "value": "none"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a64d88f7-106a-48ca-b878-9d5dac6ab60b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditAccountLockout",
            "valueJson": "\"failure\"",
            "value": "failure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8722fcc9-1fd2-4fc2-973f-c9c7234f6742",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditGroupMembership",
            "valueJson": "\"success\"",
            "value": "success"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "9ceaccee-2f1b-4279-89d0-8715d3fa2baf",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditLogon",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "12602957-ada3-4ac1-ba7f-0bfb359cb85c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditOtherLogonLogoffEvents",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6e1b0957-4b08-4fb8-a994-7a71d1fcfc49",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditSpecialLogon",
            "valueJson": "\"none\"",
            "value": "none"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "694249de-3e4c-4b50-a7e8-349a52e46263",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditSecurityGroupManagement",
            "valueJson": "\"none\"",
            "value": "none"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4b1a7b47-60a2-4859-a434-fb5c720eee95",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditUserAccountManagement",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "bb552e47-a690-4154-8fa2-dff2ff2b3f3c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditPNPActivity",
            "valueJson": "\"success\"",
            "value": "success"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "55c9cecc-93d0-4a80-be6d-31663bb80e75",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditProcessCreation",
            "valueJson": "\"success\"",
            "value": "success"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d3e9a865-2da3-4b48-a18d-ab7537034b1b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditDetailedFileShare",
            "valueJson": "\"failure\"",
            "value": "failure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "5ddb8c90-ebf9-4da0-bd72-296d7ea2c417",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditFileShare",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a76273e9-ecaf-45d6-aca7-c735eacdf972",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditOtherObjectAccessEvents",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "e428ad7e-bdf9-4b1b-a1ba-03a9d27b5cc3",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditRemovableStorage",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "063657f0-4acc-4962-9c61-568854ddd087",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditAuthenticationPolicyChange",
            "valueJson": "\"success\"",
            "value": "success"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "b237b5fa-37ea-4980-84e3-80722bc4a1fe",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditMPSSVCRuleLevelPolicyChange",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "edd9103f-cd20-4f19-887d-d30a28051263",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditOtherPolicyChangeEvents",
            "valueJson": "\"none\"",
            "value": "none"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ef654ad2-0d14-4dee-9a61-c84de8d17d9a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditPolicyChange",
            "valueJson": "\"none\"",
            "value": "none"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "53549adc-6e21-4394-9444-670a3f9d4641",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_privilegeUseAuditSensitivePrivilegeUse",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "2c820e96-4c72-470e-83c2-6d1ac5d7e4b0",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemAuditOtherSystemEvents",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c18be59c-5ce6-465a-8d74-abe5af813527",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemAuditSecurityStateChange",
            "valueJson": "\"success\"",
            "value": "success"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ef313b71-2b68-4105-a774-71a3d42ec661",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemAuditSecuritySystemExtension",
            "valueJson": "\"success\"",
            "value": "success"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "be8acd80-1c77-46ba-8cda-af5c365d01e8",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemAuditSystemIntegrity",
            "valueJson": "\"successAndFailure\"",
            "value": "successAndFailure"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "7885106a-df68-4b46-bcc2-491fd88feda2",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardSecureBootWithDMA",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "965f726e-c173-42f7-b9b1-470a3bfa4088",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardEnableVirtualizationBasedSecurity",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "55b458d4-b410-424c-837d-151a042b35ea",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLaunchSystemGuard",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d96bd1e9-b1e1-4d1c-8444-bf53b40f0750",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
            "valueJson": "\"enableWithUEFILock\"",
            "value": "enableWithUEFILock"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "8190781b-cd28-4643-87d6-0c168c08b752",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAlwaysInstallWithElevatedPrivileges",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "c51f608c-138c-4ee9-8be1-b83ccccfdd37",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAllowUserControlOverInstall",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "dd78d48f-24b2-4072-a904-b813cbc6240a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_gameDvrBlocked",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "aa3a5183-23d7-4b50-b5e9-e90b6628f835",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdobeReaderLaunchChildProcess",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c97c48d6-62be-4dff-b53d-c6b1a3d2a749",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeCommunicationAppsLaunchChildProcess",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "b59ccc6d-0872-425a-b071-15bb76b556b5",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderSignatureUpdateIntervalInHours",
            "valueJson": "4",
            "value": 4
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "41d01a51-16e0-4ccd-8967-da760982037c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanType",
            "valueJson": "\"quick\"",
            "value": "quick"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "f3905af8-47e9-4dce-b6a1-90435a1c560b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanDay",
            "valueJson": "\"everyday\"",
            "value": "everyday"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3b2d3a9c-b85e-45e6-a530-8f728e51349a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ebf6f9ce-4c24-4977-bda5-c30c9bb4c191",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderCloudBlockLevel",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "db7a1c56-535c-47aa-973e-900a94b2360c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanNetworkFiles",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "3666a2a4-05fc-497a-8a47-8e469b6f2283",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireRealTimeMonitoring",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "4494209d-90f9-4f68-8db5-7ea96f3c7d25",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanScriptsLoadedInInternetExplorer",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "cc97bbda-d192-4c92-95fc-396f3f4f30ba",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanArchiveFiles",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "983821f0-de7a-46a4-9518-f8ad87906024",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireBehaviorMonitoring",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "ab8d7d05-d962-47a0-80d2-16b24a37302b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireCloudProtection",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "c8a241cf-8e6d-49a0-9f3c-3dec4aafa3b3",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanIncomingMail",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "5b37b6e8-e4e8-4db0-bf38-5d29e4ffa10b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "173232d7-4b32-4be8-927e-056dc91b4c61",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjectionType",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6effdf22-9e7b-4436-b3dd-d1e3394ffe98",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunchType",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "0200837f-631b-4c68-9dd4-d669ea7e0a3e",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcessType",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "06da3cbb-76cc-40b9-a165-b801bce6110f",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32ImportsType",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ce76c1d5-e9bb-4f96-8492-1ed77cb3c3d8",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCodeType",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "149ece2e-e43b-48d6-b765-8a2e529aa148",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecutionType",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "37703888-79b7-47c6-b118-3589f6bd5b74",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecutionType",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ee6ef750-981a-43b8-b2a0-452455c00017",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPreventCredentialStealingType",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a73be550-f918-471c-8cfb-a78af7b4d664",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderPotentiallyUnwantedAppAction",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c7a7bf50-0685-4932-a8ac-d1937c5f1782",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcessType",
            "valueJson": "\"block\"",
            "value": "block"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "30b30ddf-be17-4ce8-a056-ed366cf82a1c",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderNetworkProtectionType",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "61bd940f-670b-4302-afae-75a0c72170d9",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType",
            "valueJson": "\"sendSafeSamplesAutomatically\"",
            "value": "sendSafeSamplesAutomatically"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "d50278d3-e641-480a-bf06-59e73652fa76",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenEnableInShell",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "06ae3d03-45d2-48be-a889-42dcd0d2c11a",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenBlockOverrideForFiles",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
            "id": "893cb114-52a3-43a7-8b01-3622555d3d05",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityHardenedUncPaths",
            "valueJson": "null",
            "implementationId": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "951390f5-7990-4a99-8212-33773557f3bf",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityDownloadingOfPrintDriversOverHttp",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "9c158797-d69b-4a54-a7a7-2a8cf6bbd9b3",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityInternetDownloadForWebPublishingAndOnlineOrderingWizards",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingInstance",
            "id": "84888b65-05e0-4bb1-a6ad-335b8286c6bb",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEncryptionSupport",
            "valueJson": "[\"tls11\",\"tls12\"]"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d21ce5a9-36fe-4f41-b8eb-427451009c24",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventManagingSmartScreenFilter",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "71899fc2-2482-4ca4-af61-44d46cb27d07",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptActiveXControlsMarkedSafeForScripting",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "622cdac3-ecb9-411f-8abc-7cb1b51e2a59",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneFileDownloads",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4ba5aaed-d387-403c-8d76-9b066a037a2f",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCertificateAddressMismatchWarning",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "e768de2a-c30e-400f-98f6-b83ea38820cd",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEnhancedProtectedMode",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "9ffcbfdb-975c-4498-bd56-0715985a65b2",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerFallbackToSsl3",
            "valueJson": "\"noSites\"",
            "value": "noSites"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8a1e7da4-f42e-48f8-adf4-a6806bb10018",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSoftwareWhenSignatureIsInvalid",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a3ee44ad-1341-46aa-9181-25359c15334a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckServerCertificateRevocation",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "5572fb15-f9d9-424f-9ada-0983a604c779",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckSignaturesOnDownloadedPrograms",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3fa6be7c-78e6-42c0-913e-94e56fce8554",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesConsistentMimeHandling",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3fcbc11e-2aca-4c1c-89fa-79dd1c66500c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarnings",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "46e24fc5-e8b7-4fd7-851a-78aeba5fa2d3",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarningsAboutUncommonFiles",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6f3da7cb-76d6-44bf-baf2-d71f0719d950",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCrashDetection",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "f08fd86b-da85-43c6-a6ec-120640cd9cf9",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerDownloadEnclosures",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "180b6ff7-10b4-4510-8c15-1bce8cc619a6",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIgnoreCertificateErrors",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3c8e35d4-16b0-46a2-8a79-0d154bc14ece",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerDisableProcessesInEnhancedProtectedMode",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "699002e1-8030-47ba-8f6f-ac7bc86b017e",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecuritySettingsCheck",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4d0f7a4f-1ea0-470e-9119-c8fda0bb6bac",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerActiveXControlsInProtectedMode",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8407254c-70b7-40ba-85fe-06de7d669baa",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersAddingSites",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6f38e39c-a1dd-43f4-9db3-747bbebfced8",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersChangingPolicies",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "2a418c97-a73f-4c16-ae0a-c6deafdf3fe0",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBlockOutdatedActiveXControls",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "5acbf57b-a094-4da3-a707-98d061843da6",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIncludeAllNetworkPaths",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "34fcbf08-91b1-410c-9134-a18480a27545",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAccessToDataSources",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "15f281cb-947a-44a7-9676-f93deffb4d09",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAutomaticPromptForFileDownloads",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "7ed23725-43e9-4430-b95d-f7a3e5feb5cf",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCopyAndPasteViaScript",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "b4b26e93-5af4-407f-a3bb-ea984ca8af8e",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragAndDropOrCopyAndPasteFiles",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4b525811-8183-4cf1-81ae-f093560a734d",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLessPrivilegedSites",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4656329b-5e56-4fd5-bc04-4fb7d7f13703",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLoadingOfXamlFiles",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "5a281bfc-8706-48a8-9200-6506772dc9ba",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDotNetFrameworkReliantComponents",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "7851f3f3-5c7c-432d-95dc-d4b0613c277c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseActiveXControls",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8c30a0f7-c8f4-40ca-b32b-05ae5d536879",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6794d3c3-0e71-4712-88ed-5c4bd4a07dbc",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptingOfWebBrowserControls",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8e05f000-7344-4a15-9379-9f1de18c6229",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptInitiatedWindows",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "fb591a5c-7b90-4af9-8ab2-944dc55014df",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptlets",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "62ef1cff-c9f4-476e-bebf-a4e1f2d8646e",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSmartScreen",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8d7ea670-82d4-46cb-9745-f60737373cea",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUpdatesToStatusBarViaScript",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4e9deee1-6540-4415-8ff8-c3b7a41c34ec",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUserDataPersistence",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c2ebf47c-2f58-47ee-990c-4fd262b1bda4",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowVBScriptToRun",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3cd60469-3764-41a8-a3ac-aa39458d22f9",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDoNotRunAntimalwareAgainstActiveXControls",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "b7532f37-4d96-49fd-9730-1a4b94e6c128",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadSignedActiveXControls",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c44ec8ba-b092-4579-9c0f-d1784a25f2c4",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadUnsignedActiveXControls",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "0dfa4747-438f-45bf-86da-e985f0664069",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCrossSiteScriptingFilter",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "b5da6b57-7615-4e07-a38e-ff49757df7ea",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsAcrossWindows",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "11a5f698-4e2a-4541-8175-efb742cb9070",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsWithinWindows",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "65b20d1e-6903-44b9-9b33-9b603a36587b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneProtectedMode",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "9e8bb45b-5e60-4457-89bd-713bb0dcbf1c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneIncludeLocalPathWhenUploadingFilesToServer",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "e50e4810-9e1c-4671-b9c4-1613ab786e90",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ce41d3e8-53af-44c6-845d-1ff65299f72e",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneJavaPermissions",
            "valueJson": "\"disableJava\"",
            "value": "disableJava"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "b2168387-94cf-44d3-997c-dc41eb0b31b6",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLaunchApplicationsAndFilesInAnIFrame",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "0d6552a5-4a9d-4537-a4ec-19045f1a145b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLogonOptions",
            "valueJson": "\"prompt\"",
            "value": "prompt"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a8ac4cbc-6e26-435b-9e52-1a442f4f277b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneNavigateWindowsAndFramesAcrossDifferentDomains",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a4109670-26bf-4a59-96a4-2fec95305ee2",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "b0382764-71de-49cc-a3ca-c909ff9d8f39",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSecurityWarningForPotentiallyUnsafeFiles",
            "valueJson": "\"prompt\"",
            "value": "prompt"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4a684c44-a9f2-4d88-a194-453dce1df7ba",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZonePopupBlocker",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6e928d98-4635-4827-be01-083ad54831bd",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneDoNotRunAntimalwareAgainstActiveXControls",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "dac17a39-8eb3-4d47-8ba9-d634142d692a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "2f2d7869-f045-4378-bbfa-627eed0c8537",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneJavaPermissions",
            "valueJson": "\"highSafety\"",
            "value": "highSafety"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ab8af09e-e44a-494c-a693-b8cb869b5d41",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneDoNotRunAntimalwareAgainstActiveXControls",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "e72049bd-4ca3-4a1d-b1c6-c7a2818a4fd6",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneJavaPermissions",
            "valueJson": "\"disableJava\"",
            "value": "disableJava"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "00d1a376-e048-4967-b14a-19dc5cb4e0d1",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownInternetZoneSmartScreen",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "311f7ef9-2774-4eef-91d5-21c611530d67",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownIntranetZoneJavaPermissions",
            "valueJson": "\"disableJava\"",
            "value": "disableJava"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "67ade93c-e616-4a7f-91c1-6b2f3373dd1d",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownLocalMachineZoneJavaPermissions",
            "valueJson": "\"disableJava\"",
            "value": "disableJava"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "abf1b37a-bda6-4248-b1ad-53ab638b6946",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneSmartScreen",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "f7bcf72c-62e2-42e0-b5dc-1ad589b039a8",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneJavaPermissions",
            "valueJson": "\"disableJava\"",
            "value": "disableJava"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "40f6bb36-fa1c-4a25-aacc-92c89e76ea1c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownTrustedZoneJavaPermissions",
            "valueJson": "\"disableJava\"",
            "value": "disableJava"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4de35a7f-5d62-4ce3-9736-2a135563618a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMimeSniffingSafetyFeature",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "74bc42cf-14a0-45db-9375-7fe443019480",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMKProtocolSecurityRestriction",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "4a460cac-1985-4586-a387-c3a1c48ff045",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesNotificationBar",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d44f3c53-9f3a-46fe-96bc-36a713ef6a65",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventPerUserInstallationOfActiveXControls",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c625b38c-8a59-4630-82bc-0800bb2a78a6",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesProtectionFromZoneElevation",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "e1de52bf-226a-4295-97fd-5a430877ca2c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRemoveRunThisTimeButtonForOutdatedActiveXControls",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c3ff1979-2427-400d-937b-f2a17f3d677a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictActiveXInstall",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8099e068-76cd-40af-a631-0346259beb97",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAccessToDataSources",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "384f66f6-0dc8-4dff-8b9e-635447f5dcd3",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneActiveScripting",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "72b05e44-83eb-4957-8f61-e900b45219e5",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAutomaticPromptForFileDownloads",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "313dc1e2-17ee-4396-8bac-d1532a89c8e7",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneBinaryAndScriptBehaviors",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "1a2fd19b-f1a2-4c72-b597-356fef08f8e4",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCopyAndPasteViaScript",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "812b8355-fdb0-4f4c-bd31-f55b103e5cd9",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragAndDropOrCopyAndPasteFiles",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "cc15d0e5-3b42-4011-85db-e76ba87de995",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLessPrivilegedSites",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d967d885-401f-4a0f-9b7a-3a9dd69da7a8",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLoadingOfXamlFiles",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "f137d15d-8ef9-45be-a5fa-f8b2f5b2123e",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneMetaRefresh",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ef5eeefa-bacc-4d23-83ec-eb859dfce773",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDotNetFrameworkReliantComponents",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c541bd31-7f88-4cbf-98f9-1846c4de2b86",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseActiveXControls",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "40300f35-31ef-41bb-922a-8963d13cd8d9",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8929b7a1-df6e-4b78-946e-e87e0383ab66",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfWebBrowserControls",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "9d063347-7b29-4039-b694-a24062e3810b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptInitiatedWindows",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ffe475d2-1957-4785-9bf3-8bf325079590",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptlets",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3062e347-704a-45c9-9d2f-e1ca489a6406",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSmartScreen",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "df9fa3fe-9b3e-4d8b-b186-8997179354ff",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUpdatesToStatusBarViaScript",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a48532a4-2f8f-49ca-868b-68016f9aa17a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUserDataPersistence",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "0b13f444-ca88-4e50-81b6-0d52eff42105",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowVBScriptToRun",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "9b6b040c-707c-409c-bf16-646f605f06c5",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDoNotRunAntimalwareAgainstActiveXControls",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ee96a08c-1bef-4e4d-8b3b-aa54c1e5c8ec",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadSignedActiveXControls",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "2997c217-5b21-43da-a680-090e77c35ddb",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadUnsignedActiveXControls",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6e38f0bf-7b14-47a0-b9c6-8d401276137b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCrossSiteScriptingFilter",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ab55bd51-161d-4944-a749-45474dbe1ae3",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsAcrossWindows",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "97a9d393-8261-47f4-82c2-59098781cd47",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsWithinWindows",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ec195d80-f894-47af-aac1-0599c543937d",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneIncludeLocalPathWhenUploadingFilesToServer",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "1520f5fd-e6ab-4afb-a0ef-c25ceadaf4be",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ef84fa2d-e976-4429-8577-e704f35f2604",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneJavaPermissions",
            "valueJson": "\"disableJava\"",
            "value": "disableJava"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "85724934-f6bf-4b05-9fa9-cec37eecfe1c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLaunchApplicationsAndFilesInAnIFrame",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "863037bd-b328-42c1-8bf9-beb1864b2c80",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLogonOptions",
            "valueJson": "\"anonymous\"",
            "value": "anonymous"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "533cd3f3-5e36-435a-85d8-85736c67582d",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneNavigateWindowsAndFramesAcrossDifferentDomains",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "c830f3cd-3963-4880-bb69-69dca505d4e7",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunActiveXControlsAndPlugins",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "0ad872cd-e31d-49e8-bb26-43eff9915746",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "b334b5ea-0abe-4b34-aa2f-a297569dfaf9",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfJavaApplets",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "18089748-5669-45d7-b3cd-c7b4495e1867",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSecurityWarningForPotentiallyUnsafeFiles",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "abf4a4b3-37b6-4801-90f8-9ef0b022df4a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneProtectedMode",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "b5dc5311-2a29-45ae-981d-9899d734d1a9",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZonePopupBlocker",
            "valueJson": "\"enable\"",
            "value": "enable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "8d135802-1a68-435a-88db-0cfc9fde34f3",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictFileDownload",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "939e1022-8608-4d9c-9915-38c5781db3e3",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesScriptedWindowSecurityRestrictions",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "609e38a2-c10b-42d4-b6c3-9c9be267d710",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecurityZonesUseOnlyMachineSettings",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "cbec235d-1ef2-49a6-ade2-c9fca220d507",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUseActiveXInstallerService",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "777ede33-5fbc-4e33-afcb-b17051537614",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneDoNotRunAntimalwareAgainstActiveXControls",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d2b412f1-8ff5-42e6-8b19-b59c0a41c7fe",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
            "valueJson": "\"disable\"",
            "value": "disable"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6650f931-62a2-473e-baec-6ff01bbaefb1",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneJavaPermissions",
            "valueJson": "\"highSafety\"",
            "value": "highSafety"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "7ded8270-7ef7-46b4-a3e3-c5a826e30906",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerAutoComplete",
            "valueJson": "\"disabled\"",
            "value": "disabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "78999682-cc32-47ad-9cbf-2738b71541a3",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_dmaGuardDeviceEnumerationPolicy",
            "valueJson": "\"blockAll\"",
            "value": "blockAll"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
            "id": "1de559e6-31c0-4005-9863-bb690e7c4e5b",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteAssistanceSolicitedSetting",
            "valueJson": "null",
            "implementationId": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
            "id": "cd4c7d74-65d2-437b-9d10-cdb2d9dc8783",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationBySetupClasses",
            "valueJson": "{\"$implementationId\":\"deviceConfiguration--hardwareDeviceInstallationBlocked\",\"removeMatchingHardwareDevices\":true,\"identifiers\":[\"{d48179be-ec20-11d1-b6b8-00c04fa372a7}\"]}",
            "implementationId": "deviceConfiguration--hardwareDeviceInstallationBlocked"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
            "id": "fb8f5f34-9763-4726-b527-28b322c1c240",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomain",
            "valueJson": "{\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}",
            "value": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "f1d0a392-08c2-41a3-9d11-a178c1f62b71",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "c9220e0e-068c-4558-932f-7a35b1a16973",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "875b14e7-d18c-42fa-9fc5-de77d4bbb7c1",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
                    "id": "eef0d7d3-f447-4f49-8a85-a4983464add8",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
                    "valueJson": "\"allowed\"",
                    "value": "allowed"
                }
            ]
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
            "id": "2db03c97-c2b5-4d4d-bc92-a47ca99086ac",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivate",
            "valueJson": "{\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}",
            "value": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "955867cd-1393-4490-9982-fdabbcd33f65",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "0bec5ba1-5188-4407-9566-22dc0064deb3",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "1d8ffbe1-66fd-4270-be77-4eb30c1eecf2",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
                    "id": "821db1b3-a244-4492-9683-70e4953c9496",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
                    "valueJson": "\"allowed\"",
                    "value": "allowed"
                }
            ]
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
            "id": "f300cc7b-2f74-467c-94b0-27490a41be36",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublic",
            "valueJson": "{\"connectionSecurityRulesFromGroupPolicyNotMerged\":true,\"policyRulesFromGroupPolicyNotMerged\":true,\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}",
            "value": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "87d4715c-9a5f-4133-b8db-aa4983b7accb",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_connectionSecurityRulesFromGroupPolicyNotMerged",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "e08e2b1d-2424-4cb8-b322-2c171e0c6bc3",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_policyRulesFromGroupPolicyNotMerged",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "0fb9b2a7-a6a3-4097-835b-8bf1e5f23827",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "e81a5031-812a-4c5d-82d8-8565e1254a1c",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "658394b0-85f7-4661-961a-20f9cd75ebd2",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
                    "valueJson": "true",
                    "value": true
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
                    "id": "a5865030-c27a-427f-b52d-c11c94558059",
                    "definitionId": "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
                    "valueJson": "\"allowed\"",
                    "value": "allowed"
                }
            ]
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
            "id": "feac0146-3454-4f1c-a8d2-6aa937d7a3ed",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
            "valueJson": "{\"requireEncryptionForWriteAccess\":true}",
            "value": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
                    "id": "e3970c76-801c-448b-aec0-d006aaf5f94b",
                    "definitionId": "deviceConfiguration--bitLockerRemovableDrivePolicy_requireEncryptionForWriteAccess",
                    "valueJson": "true",
                    "value": true
                }
            ]
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "582b3731-b8bf-435a-afaf-460b7adf5482",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_searchDisableIndexingEncryptedItems",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "10b98fae-2467-44c3-adcd-b5518889f015",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordRequired",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ae031556-432b-4bd7-bbd9-37574c75903b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordRequiredType",
            "valueJson": "\"alphanumeric\"",
            "value": "alphanumeric"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "2ca01367-963a-4e68-87e3-2c1d31d543bd",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordExpirationDays",
            "valueJson": "60",
            "value": 60
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "9e2ca71c-4444-4860-97f7-b96a8df10919",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumCharacterSetCount",
            "valueJson": "3",
            "value": 3
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "5039acc2-fa3d-4b92-a26d-35aef03b29b3",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordPreviousPasswordBlockCount",
            "valueJson": "24",
            "value": 24
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "4e8e6ff7-1872-4c3f-98d9-ef6944e6793e",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumLength",
            "valueJson": "8",
            "value": 8
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "548868fc-919f-4ce8-ae7a-184579ab0ae1",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordSignInFailureCountBeforeFactoryReset",
            "valueJson": "10",
            "value": 10
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "b2680af4-f215-4e85-aaa9-ac5fef6cb7e5",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumAgeInDays",
            "valueJson": "1",
            "value": 1
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "7f75621d-1411-4898-9d32-8ad8bc833c06",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordBlockSimple",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d4a833d5-e96f-4a19-9c28-cde1c62e2a89",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_lockScreenCamera",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "eaa082ef-fb68-433e-b7e5-d4b70bf385eb",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_lockScreenSlideShow",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d9ebdb99-478e-4d62-9718-3eaa57795751",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_inkWorkspaceAccess",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "7423d0ef-6932-402f-9573-fd91c23319c6",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_powerShellShellScriptBlockLogging",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "034c719e-62a3-4cb8-a0c0-230c652268d0",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_appsMicrosoftAccountsOptional",
            "valueJson": "\"enabled\"",
            "value": "enabled"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "331b87fb-d88c-468e-81b7-b25e57de0585",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_autoPlayDefaultAutoRunBehavior",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "7e550316-3393-4132-888d-a865e4b1ac5b",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_autoPlayMode",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "cf34bed6-7442-428a-bba3-a965c69e6d41",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_autoPlayForNonVolumeDevices",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "5c2923b9-4359-4697-9a8e-2fa9cd97996f",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_edgeBlockPasswordManager",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "5c01dd7b-1598-4edd-b7e9-0bdd3987ada1",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_edgeRequireSmartScreen",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "ddacc9d6-6692-4555-889e-10273fc912ac",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverride",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "546cb7d8-68e2-492c-9c65-2e125415409a",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverrideForFiles",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "82fb9f50-3dd5-402b-97e1-64f1b7a126b6",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_edgePreventCertificateErrorOverride",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "1fccad5e-20f1-45ed-9ba5-7bc9a7a25438",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteHostDelegationOfNonExportableCredentials",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "fbdb4d45-fc95-4663-8689-716d6e975ee8",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_credentialsUIEnumerateAdministrators",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "37fb0415-ddeb-4033-a01f-6843ef7d330c",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_dataProtectionBlockDirectMemoryAccess",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "f483add7-de56-464d-9634-36f273c8168d",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceApplicationLogMaximumFileSizeInKb",
            "valueJson": "null",
            "value": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "617213cf-6eac-4876-b869-f26a4a017c21",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSystemLogMaximumFileSizeInKb",
            "valueJson": "null",
            "value": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "173a25f9-4143-43e4-8610-e871faf0b9dd",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSecurityLogMaximumFileSizeInKb",
            "valueJson": "null",
            "value": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "0c61b2ca-f261-433b-a677-96de8b565686",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlocked",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "10e5a1f5-ba62-4030-ae86-32f9a62ea047",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockThirdPartyNotifications",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "0a6184bb-9264-4485-a639-c2d41e42b072",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockConsumerSpecificFeatures",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "2f1d1105-68aa-4161-b27d-8dbc4bef2158",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_explorerDataExecutionPrevention",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "21b2e6e5-48ca-46dd-8fb6-690e96809194",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_explorerHeapTerminationOnCorruption",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "1236feaa-5dc7-4743-9957-e7bbcfe53b6d",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsBlockRemoteLogonWithBlankPassword",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "6fe10ea4-7325-4176-82be-0cd24b6e6b12",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMachineInactivityLimit",
            "valueJson": "15",
            "value": 15
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "0e828791-49a0-448e-8d40-2ef839496881",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsSmartCardRemovalBehavior",
            "valueJson": "\"lockWorkstation\"",
            "value": "lockWorkstation"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "a16ae196-ba36-4ac4-ad9d-898ef8f66848",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientDigitallySignCommunicationsAlways",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "9961f0e5-7c44-4960-b630-b988ce646b01",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "2be82427-30a3-4670-82ea-92a406af4396",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableServerDigitallySignCommunicationsAlways",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "6481ac77-1f8e-498b-a151-ea8447d5a0e5",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "867fbe30-2787-4349-9475-eec295825980",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "173259f2-de77-431f-ae8c-dbdc714298a3",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "d582a673-00db-42c1-adca-9b9d9eaddd05",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager",
            "valueJson": "\"\"",
            "value": ""
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "6c5053e8-cfeb-4c2e-8b0f-441ed1ba822a",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "18e7b7c9-acb0-416c-aa26-96d70d2c8c61",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerAuthenticationLevel",
            "valueJson": "\"lmNtlmV2AndNotLmOrNtm\"",
            "value": "lmNtlmV2AndNotLmOrNtm"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ff15483d-210d-4130-bc8c-884fd69fe8b1",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients",
            "valueJson": "\"ntlmV2And128BitEncryption\"",
            "value": "ntlmV2And128BitEncryption"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "16ce9a75-cdd7-4c5a-b724-b15daafd5261",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers",
            "valueJson": "\"ntlmV2And128BitEncryption\"",
            "value": "ntlmV2And128BitEncryption"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6fe2a2a1-f445-4e9f-a874-a54dd28c69cd",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAdministratorElevationPromptBehavior",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3efd56cd-591d-4446-be0a-55ba632d533f",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsStandardUserElevationPromptBehavior",
            "valueJson": "\"automaticallyDenyElevationRequests\"",
            "value": "automaticallyDenyElevationRequests"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "2e298c90-94a3-4573-9788-1ad2dd0ceee6",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "de4c9f15-c266-4b6b-8f6a-0b79a49fbe07",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowUIAccessApplicationsForSecureLocations",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "fcfc9f80-4a7e-46e1-a67d-ecfce9f58ae2",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalModeForAdministrators",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "05ff5b92-5642-40cb-bc73-99cf6802c370",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalMode",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "2fd1fdf2-1ab4-4779-a291-adfcd0de4397",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "06ec822b-a234-40b4-a964-35ca7c311c28",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1ClientDriverStartConfiguration",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "fece0463-e19f-4b96-b791-66cb3d00e7e7",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideApplyUacRestrictionsToLocalAccountsOnNetworkLogon",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "98c9826c-8184-4b12-90ae-ca2596a823c7",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideStructuredExceptionHandlingOverwriteProtection",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "98ecfdea-14a8-41d0-8fc1-61a347f1ef3a",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1Server",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "83ff2c47-9168-4963-b203-cda11d77c442",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideWDigestAuthentication",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3e7d8e57-987b-48f2-94f4-0b259e1f7136",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpV6SourceRoutingProtectionLevel",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "44f07338-6ce8-4a40-b9b2-1533bf8f34ae",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpSourceRoutingProtectionLevel",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "be6a2667-0b1c-4887-8229-df9519258224",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIgnoreNetBiosNameReleaseRequestsExceptFromWinsServers",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "37d428e5-5c2b-42fa-a3e6-663b21bf4b6c",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIcmpRedirectsOverrideOspfGeneratedRoutes",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "923e09e9-47ae-4afe-8bae-a28b33db6530",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhileOnBattery",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "83f7c9ef-2d1e-423b-ae53-a1eb75aa8d39",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhilePluggedIn",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "84c74945-d5ac-47e4-8f0e-b3b180d0f38f",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhileOnBattery",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "e2eb6435-6829-4469-9582-0c1cec7adeab",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhilePluggedIn",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "3e313a3a-e546-4a1a-b2c4-513ddae13e61",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesClientConnectionEncryptionLevel",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a9534967-4dfe-43d5-8038-8e1f5bccebcc",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesDriveRedirection",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "06142b2a-5ecd-4373-b650-26ba4ab3389f",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPasswordSaving",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "dcd5f5ac-1047-4aac-bca6-6f402b052ccf",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPromptForPasswordUponConnection",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "ddaddb05-69f9-41f5-8cba-58c0736c1a83",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesSecureRpcCommunication",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "0db4cbf5-7207-4890-b006-2eb1de3f6ba1",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientDigestAuthentication",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "236144f7-4d6c-4115-b320-c09dbe6850e0",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceStoringRunAsCredentials",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "31c2479c-65be-46bb-bb4b-ed85bdf622f6",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientBasicAuthentication",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "f2472aa0-115f-432a-9805-47aaf81cc95f",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceBasicAuthentication",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "23b67c55-f0c4-4b84-9388-3e641dd5bb07",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientUnencryptedTraffic",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "819afffd-f4e9-4bc3-9ef0-f69ac922bdc8",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceUnencryptedTraffic",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "04f255f6-036a-4311-83f4-a9e82e81abb5",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_rpcUnauthenticatedClientOptions",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "a0d42b93-4870-4e51-b247-94d5a2a5a885",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemBootStartDriverInitialization",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "a9a6367d-15c9-4467-93e7-481f6a59c725",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_wiFiBlockAutomaticConnectHotspots",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "7a8201f5-fe25-4345-8e55-64e596d4cbf1",
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetSharingBlocked",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "0c904ab4-6348-4bca-a9fd-93959eed019a",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_windowsConnectionManagerConnectionToNonDomainNetworks",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        }
    ]
}